app/controllers/users_controller.rb

    def create
        @user = User.new(params[:user])
        if @user.save
---
INSERT INTO "users" ("created_at", "last_request_at", "crypted_password", "updated_at", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at") VALUES('2011-09-26 15:35:53', '2011-09-26 15:35:53', 'de04a6844558c92a6f74cde7bfd0aa578e6413a3be43e3c5824b6a12a89591f3889798da3c02e1eda9c12cf6a8be3415bd0618c2024387ebd0dbdf297bfcb955', '2011-09-26 15:35:53', '127.0.0.1', 'ERG0gPfnNGhgj9AzH', '2011-09-26 15:35:53', '63315fed56ef7f7c0992e099a225cb81ff0f79ec8c2cdeb6ef87b6d9bc81ac35e9225158ad56b7df1db8093849e1e86be17c00a6edadd30670247500940e40de', 1, NULL, 'dddddd', NULL)